/* Created by frank on 14-8-20. */
angular.module('app')
    .constant('errors', {
        40000: i18n('参数错误'),
        40087: 后台仍在处理房产，请稍后再试
        40100: i18n('请先<a href="/admin#/signIn">登录</a>'),
        40101: i18n('请求过于频繁，请稍后再试'),
        40103: i18n('电话或密码错误'),
        40105: i18n('没有管理员权限或管理员级别不够'),
        //TODO: server side mistake TBD
        40109: i18n('没有权限'),
        40300: i18n('没有权限'),
        40301: i18n('no ad in given channel'),
        40302: i18n('不存在的博客文章'),
        40314: i18n('不存在的消息'),
        40324: i18n('不存在的用户'),
        40325: i18n('电子邮件已存在'),
        40326: i18n('权限已存在'),
        40327: i18n('权限不存在'),
        40328: i18n('标签已存在'),
        40329: i18n('标签不存在'),
        40351: i18n('手机号码已被占用'),
        40352: i18n('请求过于频繁'),
        40353: i18n('不存在的反馈'),
        40354: i18n('信用额度不够'),
        40356: i18n('已存在的标签'),
        40399: i18n('没有权限'),
        40400: i18n('找不到数据'),
        404: i18n('找不到资源'),
        40501: i18n('请使用HTTPS重试'),
        50000: i18n('服务器异常'),
        50300: i18n('外部服务的错误'),
        50308: i18n('SMS未知错误'),
        50314: i18n('验证码错误'),
        unknown: i18n('服务器繁忙，请稍后再试')
    })
